Repository: zziri/cmux
Catalog: Resources/Localizable.xcstrings
Source language: en
Languages: ar, bs, da, de, es, fr, it, ja, ko, nb, pl, pt_br, ru, th, tr, uk, zh_hans, zh_hant

# settings.browser.history.clearDialog.message
source: This removes visited-page suggestions from the browser omnibar.
ar: يؤدي هذا إلى إزالة اقتراحات الصفحات المزارة من شريط عنوان المتصفح.
bs: Ovo uklanja prijedloge posjećenih stranica iz omnibar preglednika.
da: Dette fjerner besøgte sideforslag fra browserens omnibar.
de: Dies entfernt Vorschläge für besuchte Seiten aus der Browser-Adressleiste.
es: Esto elimina las sugerencias de páginas visitadas de la barra de direcciones del navegador.
fr: Cela supprime les suggestions de pages visitées de la barre d'adresse du navigateur.
it: Questa operazione rimuove i suggerimenti delle pagine visitate dalla barra degli indirizzi del browser.
ja: ブラウザのオムニバーから訪問済みページの候補が削除されます。
ko: 브라우저 옴니바에서 방문 페이지 제안을 제거합니다.
nb: Dette fjerner forslag basert på besøkte sider fra nettleserens adressefelt.
pl: Spowoduje to usunięcie podpowiedzi odwiedzonych stron z paska adresu przeglądarki.
pt_br: Isto remove as sugestões de páginas visitadas da barra de endereço do navegador.
ru: Это удалит подсказки посещенных страниц из адресной строки браузера.
th: การดำเนินการนี้จะลบคำแนะนำหน้าที่เยี่ยมชมจากแถบที่อยู่เบราว์เซอร์
tr: Bu, tarayıcı çok amaçlı çubuğundan ziyaret edilen sayfa önerilerini kaldırır.
uk: Це видалить підказки відвіданих сторінок з адресного рядка браузера.
zh_hans: 这将从浏览器地址栏中移除已访问页面的建议。
zh_hant: 這會移除瀏覽器網址列中已造訪頁面的建議。

# settings.browser.history.clearDialog.title
source: Clear browser history?
ar: مسح سجل المتصفح؟
bs: Obrisati historiju preglednika?
da: Ryd browserhistorik?
de: Browserverlauf löschen?
es: ¿Borrar historial del navegador?
fr: Effacer l'historique du navigateur ?
it: Cancellare la cronologia del browser?
ja: ブラウザ履歴をクリアしますか？
ko: 브라우저 기록을 지우시겠습니까?
nb: Tømme nettleserhistorikk?
pl: Wyczyścić historię przeglądarki?
pt_br: Limpar histórico do navegador?
ru: Очистить историю браузера?
th: ล้างประวัติเบราว์เซอร์หรือไม่?
tr: Tarayıcı geçmişi temizlensin mi?
uk: Очистити історію браузера?
zh_hans: 清除浏览器历史记录？
zh_hant: 要清除瀏覽記錄嗎？

# settings.browser.history.subtitleEmpty
source: No saved pages yet.
ar: لا توجد صفحات محفوظة بعد.
bs: Još nema sačuvanih stranica.
da: Ingen gemte sider endnu.
de: Noch keine gespeicherten Seiten.
es: Aún no hay páginas guardadas.
fr: Aucune page enregistrée pour le moment.
it: Nessuna pagina salvata.
ja: 保存済みのページはまだありません。
ko: 아직 저장된 페이지가 없습니다.
nb: Ingen lagrede sider ennå.
pl: Brak zapisanych stron.
pt_br: Nenhuma página salva ainda.
ru: Сохраненных страниц пока нет.
th: ยังไม่มีหน้าที่บันทึก
tr: Henüz kayıtlı sayfa yok.
uk: Збережених сторінок ще немає.
zh_hans: 尚无已保存的页面。
zh_hant: 尚無已儲存的頁面。

# settings.browser.history.subtitleLoading
source: Checking browsing history...
ar: جارٍ التحقق من سجل التصفح...
bs: Provjerava se historija pregledanja...
da: Kontrollerer browserhistorik...
de: Browserverlauf wird geprüft...
es: Comprobando el historial de navegación...
fr: Vérification de l'historique de navigation...
it: Controllo della cronologia di navigazione...
ja: 閲覧履歴を確認中...
ko: 방문 기록을 확인하는 중...
nb: Sjekker nettleserhistorikk...
pl: Sprawdzanie historii przeglądania...
pt_br: Verificando histórico de navegação...
ru: Проверка истории браузера...
th: กำลังตรวจสอบประวัติการท่องเว็บ...
tr: Tarama geçmişi kontrol ediliyor...
uk: Перевірка історії браузера...
zh_hans: 正在检查浏览历史记录...
zh_hant: 正在檢查瀏覽歷史記錄...

# settings.browser.history.subtitleMany
source: %lld saved pages appear in omnibar suggestions.
ar: %lld صفحة محفوظة تظهر في اقتراحات شريط العنوان.
bs: %lld sačuvanih stranica se pojavljuje u prijedlozima omnibara.
da: %lld gemte sider vises i omnibar-forslag.
de: %lld gespeicherte Seiten erscheinen in den Vorschlägen der Omnibar.
es: %lld páginas guardadas aparecen en las sugerencias de la omnibarra.
fr: %lld pages enregistrées apparaissent dans les suggestions de l'omnibar.
it: %lld pagine salvate appaiono nei suggerimenti della barra degli indirizzi.
ja: %lld件の保存されたページがオムニバーの候補に表示されます。
ko: %lld개의 저장된 페이지가 옴니바 제안에 표시됩니다.
nb: %lld lagrede sider vises i adressefeltforslag.
pl: %lld zapisanych stron pojawia się w podpowiedziach paska adresu.
pt_br: %lld páginas salvas aparecem nas sugestões da barra de endereço.
ru: Сохраненных страниц: %lld. Отображаются в подсказках адресной строки.
th: %lld หน้าที่บันทึกจะปรากฏในคำแนะนำแถบที่อยู่
tr: %lld kayıtlı sayfa çok amaçlı çubuk önerilerinde görünür.
uk: %lld збережених сторінок з'являються у підказках адресного рядка.
zh_hans: 已保存的 %lld 个页面将显示在地址栏建议中。
zh_hant: %lld 個已儲存的頁面會顯示在網址列建議中。

# settings.browser.history.subtitleOne
source: 1 saved page appears in omnibar suggestions.
ar: صفحة محفوظة واحدة تظهر في اقتراحات شريط العنوان.
bs: 1 sačuvana stranica se pojavljuje u prijedlozima omnibara.
da: 1 gemt side vises i omnibar-forslag.
de: 1 gespeicherte Seite erscheint in den Adressleisten-Vorschlägen.
es: 1 página guardada aparece en las sugerencias de la barra de direcciones.
fr: 1 page enregistrée apparaît dans les suggestions de la barre d'adresse.
it: 1 pagina salvata appare nei suggerimenti della barra degli indirizzi.
ja: 1件の保存済みページがオムニバーの候補に表示されます。
ko: 1개의 저장된 페이지가 옴니바 제안에 표시됩니다.
nb: 1 lagret side vises i adressefeltforslag.
pl: 1 zapisana strona pojawia się w podpowiedziach paska adresu.
pt_br: 1 página salva aparece nas sugestões da barra de endereço.
ru: 1 сохраненная страница отображается в подсказках адресной строки.
th: 1 หน้าที่บันทึกจะปรากฏในคำแนะนำแถบที่อยู่
tr: 1 kayıtlı sayfa çok amaçlı çubuk önerilerinde görünür.
uk: 1 збережена сторінка з'являється у підказках адресного рядка.
zh_hans: 1 个已保存页面显示在地址栏建议中。
zh_hant: 1 個已儲存頁面會出現在網址列建議中。

# settings.browser.hostWhitelist
source: Hosts to Open in Embedded Browser
ar: المضيفون للفتح في المتصفح المضمّن
bs: Hostovi za otvaranje u ugrađenom pregledniku
da: Værter der åbnes i den indlejrede browser
de: Hosts, die im integrierten Browser geöffnet werden
es: Hosts para abrir en el navegador integrado
fr: Hôtes à ouvrir dans le navigateur intégré
it: Host da aprire nel browser integrato
ja: 内蔵ブラウザで開くホスト
ko: 내장 브라우저에서 열 호스트
nb: Verter som åpnes i innebygd nettleser
pl: Hosty do otwierania we wbudowanej przeglądarce
pt_br: Hosts para Abrir no Navegador Integrado
ru: Хосты для открытия во встроенном браузере
th: โฮสต์ที่เปิดในเบราว์เซอร์ในตัว
tr: Gömülü Tarayıcıda Açılacak Ana Bilgisayarlar
uk: Хости для відкриття у вбудованому браузері
zh_hans: 在内嵌浏览器中打开的主机
zh_hant: 在內建瀏覽器中開啟的主機

# settings.browser.hostWhitelist.subtitle
source: Applies to terminal link clicks and intercepted `open https://...` calls. Only these hosts open in cmux. Others open in your default browser. One host or wildcard per line (for example: example.com, *.internal.example). Leave empty to open all hosts in cmux.
ar: ينطبق على نقرات الروابط في الطرفية واستدعاءات `open https://...` المعترضة. فقط هؤلاء المضيفون يفتحون في cmux. البقية تفتح في متصفحك الافتراضي. مضيف واحد أو حرف بدل لكل سطر (مثال: example.com, *.internal.example). اتركه فارغًا لفتح جميع المضيفين في cmux.
bs: Primjenjuje se na klikove linkova u terminalu i presretnute `open https://...` pozive. Samo se ovi hostovi otvaraju u cmux. Ostali se otvaraju u podrazumijevanom pregledniku. Jedan host ili zamjenski znak po redu (na primjer: example.com, *.internal.example). Ostavite prazno da otvorite sve hostove u cmux.
da: Gælder for terminallinksklik og opfangede `open https://...`-kald. Kun disse værter åbnes i cmux. Andre åbnes i din standardbrowser. Én vært eller wildcard pr. linje (f.eks.: example.com, *.internal.example). Lad stå tomt for at åbne alle værter i cmux.
de: Gilt für Klicks auf Terminal-Links und abgefangene `open https://...`-Aufrufe. Nur diese Hosts werden in cmux geöffnet. Andere werden in Ihrem Standardbrowser geöffnet. Ein Host oder Platzhalter pro Zeile (zum Beispiel: example.com, *.internal.example). Leer lassen, um alle Hosts in cmux zu öffnen.
es: Se aplica a clics en enlaces del terminal y llamadas interceptadas de `open https://...`. Solo estos hosts se abren en cmux. Los demás se abren en tu navegador predeterminado. Un host o comodín por línea (por ejemplo: example.com, *.internal.example). Déjalo vacío para abrir todos los hosts en cmux.
fr: S'applique aux clics sur les liens du terminal et aux appels `open https://...` interceptés. Seuls ces hôtes s'ouvrent dans cmux. Les autres s'ouvrent dans votre navigateur par défaut. Un hôte ou caractère générique par ligne (par exemple : example.com, *.internal.example). Laissez vide pour ouvrir tous les hôtes dans cmux.
it: Si applica ai clic sui link nel terminale e alle chiamate intercettate `open https://...`. Solo questi host si aprono in cmux. Gli altri si aprono nel browser predefinito. Un host o wildcard per riga (ad esempio: example.com, *.internal.example). Lascia vuoto per aprire tutti gli host in cmux.
ja: ターミナルのリンククリックおよびインターセプトされた`open https://...`呼び出しに適用されます。これらのホストのみcmuxで開きます。その他はデフォルトブラウザで開きます。1行に1つのホストまたはワイルドカード（例: example.com, *.internal.example）。空欄にするとすべてのホストをcmuxで開きます。
ko: 터미널 링크 클릭 및 인터셉트된 `open https://...` 호출에 적용됩니다. 이 호스트만 cmux에서 열립니다. 나머지는 기본 브라우저에서 열립니다. 한 줄에 하나의 호스트 또는 와일드카드 (예: example.com, *.internal.example). 비워두면 모든 호스트가 cmux에서 열립니다.
nb: Gjelder for terminallenkeklikk og avlyttede `open https://...`-kall. Bare disse vertene åpnes i cmux. Andre åpnes i standard nettleser. Én vert eller jokertegn per linje (for eksempel: example.com, *.internal.example). La stå tom for å åpne alle verter i cmux.
pl: Dotyczy kliknięć linków w terminalu i przechwyconych wywołań `open https://...`. Tylko te hosty otwierają się w cmux. Pozostałe otwierają się w domyślnej przeglądarce. Jeden host lub wzorzec na wiersz (na przykład: example.com, *.internal.example). Pozostaw puste, aby otwierać wszystkie hosty w cmux.
pt_br: Aplica-se a cliques em links do terminal e chamadas interceptadas de `open https://...`. Apenas estes hosts abrem no cmux. Outros abrem no seu navegador padrão. Um host ou curinga por linha (por exemplo: example.com, *.internal.example). Deixe vazio para abrir todos os hosts no cmux.
ru: Применяется к нажатиям на ссылки в терминале и перехваченным вызовам `open https://...`. Только эти хосты открываются в cmux. Остальные открываются в браузере по умолчанию. Один хост или шаблон на строку (например: example.com, *.internal.example). Оставьте пустым, чтобы открывать все хосты в cmux.
th: ใช้กับการคลิกลิงก์ในเทอร์มินัลและการดักจับคำสั่ง `open https://...` เฉพาะโฮสต์เหล่านี้เท่านั้นที่จะเปิดใน cmux โฮสต์อื่นจะเปิดในเบราว์เซอร์เริ่มต้นของคุณ โฮสต์หรือ wildcard หนึ่งรายการต่อบรรทัด (ตัวอย่าง: example.com, *.internal.example) เว้นว่างเพื่อเปิดโฮสต์ทั้งหมดใน cmux
tr: Terminal bağlantı tıklamalarına ve yakalanan `open https://...` çağrılarına uygulanır. Yalnızca bu ana bilgisayarlar cmux'ta açılır. Diğerleri varsayılan tarayıcınızda açılır. Satır başına bir ana bilgisayar veya joker karakter (örneğin: example.com, *.internal.example). Tüm ana bilgisayarları cmux'ta açmak için boş bırakın.
uk: Застосовується до кліків на посилання в терміналі та перехоплених викликів `open https://...`. Тільки ці хости відкриваються в cmux. Інші відкриваються у стандартному браузері. Один хост або шаблон на рядок (наприклад: example.com, *.internal.example). Залиште порожнім, щоб відкривати всі хости в cmux.
zh_hans: 适用于终端中的链接点击和拦截的 `open https://...` 调用。仅这些主机在 cmux 中打开，其他主机在默认浏览器中打开。每行一个主机或通配符（例如：example.com、*.internal.example）。留空则在 cmux 中打开所有主机。
zh_hant: 套用於終端機連結點擊和攔截的 `open https://...` 呼叫。僅這些主機會在 cmux 中開啟，其他主機會在您的預設瀏覽器中開啟。每行一個主機或萬用字元（例如：example.com、*.internal.example）。留空則在 cmux 中開啟所有主機。

# settings.browser.httpAllowlist
source: HTTP Hosts Allowed in Embedded Browser
ar: مضيفو HTTP المسموح بهم في المتصفح المضمّن
bs: HTTP hostovi dozvoljeni u ugrađenom pregledniku
da: HTTP-værter tilladt i den indlejrede browser
de: HTTP-Hosts, die im integrierten Browser zugelassen sind
es: Hosts HTTP permitidos en el navegador integrado
fr: Hôtes HTTP autorisés dans le navigateur intégré
it: Host HTTP consentiti nel browser integrato
ja: 内蔵ブラウザで許可するHTTPホスト
ko: 내장 브라우저에서 허용할 HTTP 호스트
nb: HTTP-verter tillatt i innebygd nettleser
pl: Hosty HTTP dozwolone we wbudowanej przeglądarce
pt_br: Hosts HTTP Permitidos no Navegador Integrado
ru: HTTP-хосты, разрешенные во встроенном браузере
th: โฮสต์ HTTP ที่อนุญาตในเบราว์เซอร์ในตัว
tr: Gömülü Tarayıcıda İzin Verilen HTTP Ana Bilgisayarları
uk: HTTP-хости, дозволені у вбудованому браузері
zh_hans: 内嵌浏览器中允许的 HTTP 主机
zh_hant: 允許在內建瀏覽器中使用的 HTTP 主機

# settings.browser.httpAllowlist.description
source: Controls which HTTP (non-HTTPS) hosts can open in cmux without a warning prompt. Defaults include localhost, *.localhost, 127.0.0.1, ::1, 0.0.0.0, and *.localtest.me. Remove entries to block them; reset to restore defaults.
ar: يتحكم في مضيفي HTTP (غير HTTPS) الذين يمكنهم الفتح في cmux بدون رسالة تحذير. الافتراضيات تشمل localhost و *.localhost و 127.0.0.1 و ::1 و 0.0.0.0 و *.localtest.me.
bs: Kontroliše koji HTTP (ne-HTTPS) hostovi mogu biti otvoreni u cmux bez upozorenja. Podrazumijevani uključuju localhost, *.localhost, 127.0.0.1, ::1, 0.0.0.0 i *.localtest.me.
da: Styrer hvilke HTTP-værter (ikke-HTTPS) der kan åbnes i cmux uden advarselsmeddelelse. Standardindstillinger inkluderer localhost, *.localhost, 127.0.0.1, ::1, 0.0.0.0 og *.localtest.me.
de: Steuert, welche HTTP-Hosts (nicht HTTPS) ohne Warnhinweis in cmux geöffnet werden können. Standardmäßig enthalten: localhost, *.localhost, 127.0.0.1, ::1, 0.0.0.0 und *.localtest.me.
es: Controla qué hosts HTTP (no HTTPS) pueden abrirse en cmux sin un mensaje de advertencia. Los valores predeterminados incluyen localhost, *.localhost, 127.0.0.1, ::1, 0.0.0.0 y *.localtest.me.
fr: Contrôle quels hôtes HTTP (non HTTPS) peuvent s'ouvrir dans cmux sans avertissement. Les valeurs par défaut incluent localhost, *.localhost, 127.0.0.1, ::1, 0.0.0.0 et *.localtest.me.
it: Controlla quali host HTTP (non HTTPS) possono aprirsi in cmux senza un avviso. I valori predefiniti includono localhost, *.localhost, 127.0.0.1, ::1, 0.0.0.0 e *.localtest.me.
ja: 警告プロンプトなしでcmuxで開けるHTTP（非HTTPS）ホストを制御します。デフォルトにはlocalhost、*.localhost、127.0.0.1、::1、0.0.0.0、*.localtest.meが含まれます。エントリを削除するとそのホストをブロックし、リセットでデフォルトに戻せます。
ko: cmux에서 경고 없이 열 수 있는 HTTP(비HTTPS) 호스트를 제어합니다. 기본값에는 localhost, *.localhost, 127.0.0.1, ::1, 0.0.0.0 및 *.localtest.me가 포함됩니다.
nb: Styrer hvilke HTTP-verter (ikke HTTPS) som kan åpnes i cmux uten advarselsmelding. Standardverdier inkluderer localhost, *.localhost, 127.0.0.1, ::1, 0.0.0.0 og *.localtest.me.
pl: Określa, które hosty HTTP (inne niż HTTPS) mogą być otwierane w cmux bez ostrzeżenia. Domyślnie uwzględniono localhost, *.localhost, 127.0.0.1, ::1, 0.0.0.0 i *.localtest.me.
pt_br: Controla quais hosts HTTP (não HTTPS) podem abrir no cmux sem um aviso. Os padrões incluem localhost, *.localhost, 127.0.0.1, ::1, 0.0.0.0 e *.localtest.me.
ru: Определяет, какие HTTP (не HTTPS) хосты могут открываться в cmux без предупреждения. По умолчанию включены localhost, *.localhost, 127.0.0.1, ::1, 0.0.0.0 и *.localtest.me.
th: ควบคุมว่าโฮสต์ HTTP (ไม่ใช่ HTTPS) ใดที่สามารถเปิดใน cmux โดยไม่ต้องแสดงคำเตือน ค่าเริ่มต้นรวมถึง localhost, *.localhost, 127.0.0.1, ::1, 0.0.0.0 และ *.localtest.me
tr: Hangi HTTP (HTTPS olmayan) ana bilgisayarlarının cmux'ta uyarı istemi olmadan açılabileceğini kontrol eder. Varsayılanlar localhost, *.localhost, 127.0.0.1, ::1, 0.0.0.0 ve *.localtest.me içerir.
uk: Визначає, які HTTP (не HTTPS) хости можуть відкриватися в cmux без попередження. Типово включає localhost, *.localhost, 127.0.0.1, ::1, 0.0.0.0 та *.localtest.me.
zh_hans: 控制哪些 HTTP（非 HTTPS）主机可以在 cmux 中打开而不显示警告提示。默认包括 localhost、*.localhost、127.0.0.1、::1、0.0.0.0 和 *.localtest.me。
zh_hant: 控制哪些 HTTP（非 HTTPS）主機可以在 cmux 中開啟而不顯示警告提示。預設包含 localhost、*.localhost、127.0.0.1、::1、0.0.0.0 和 *.localtest.me。

# settings.browser.httpAllowlist.hint
source: One host or wildcard per line. Remove entries to block them.
ar: مضيف واحد أو حرف بدل لكل سطر (مثال: localhost, *.localhost, 127.0.0.1, ::1, 0.0.0.0, *.localtest.me).
bs: Jedan host ili zamjenski znak po redu (na primjer: localhost, *.localhost, 127.0.0.1, ::1, 0.0.0.0, *.localtest.me).
da: Én vært eller wildcard pr. linje (f.eks.: localhost, *.localhost, 127.0.0.1, ::1, 0.0.0.0, *.localtest.me).
de: Ein Host oder Platzhalter pro Zeile (zum Beispiel: localhost, *.localhost, 127.0.0.1, ::1, 0.0.0.0, *.localtest.me).
es: Un host o comodín por línea (por ejemplo: localhost, *.localhost, 127.0.0.1, ::1, 0.0.0.0, *.localtest.me).
fr: Un hôte ou caractère générique par ligne (par exemple : localhost, *.localhost, 127.0.0.1, ::1, 0.0.0.0, *.localtest.me).
it: Un host o wildcard per riga (ad esempio: localhost, *.localhost, 127.0.0.1, ::1, 0.0.0.0, *.localtest.me).
ja: 1行に1つのホストまたはワイルドカード。エントリを削除するとそのホストをブロックします。
ko: 한 줄에 하나의 호스트 또는 와일드카드 (예: localhost, *.localhost, 127.0.0.1, ::1, 0.0.0.0, *.localtest.me).
nb: Én vert eller jokertegn per linje (for eksempel: localhost, *.localhost, 127.0.0.1, ::1, 0.0.0.0, *.localtest.me).
pl: Jeden host lub wzorzec na wiersz (na przykład: localhost, *.localhost, 127.0.0.1, ::1, 0.0.0.0, *.localtest.me).
pt_br: Um host ou curinga por linha (por exemplo: localhost, *.localhost, 127.0.0.1, ::1, 0.0.0.0, *.localtest.me).
ru: Один хост или шаблон на строку (например: localhost, *.localhost, 127.0.0.1, ::1, 0.0.0.0, *.localtest.me).
th: โฮสต์หรือ wildcard หนึ่งรายการต่อบรรทัด (ตัวอย่าง: localhost, *.localhost, 127.0.0.1, ::1, 0.0.0.0, *.localtest.me)
tr: Satır başına bir ana bilgisayar veya joker karakter (örneğin: localhost, *.localhost, 127.0.0.1, ::1, 0.0.0.0, *.localtest.me).
uk: Один хост або шаблон на рядок (наприклад: localhost, *.localhost, 127.0.0.1, ::1, 0.0.0.0, *.localtest.me).
zh_hans: 每行一个主机或通配符（例如：localhost、*.localhost、127.0.0.1、::1、0.0.0.0、*.localtest.me）。
zh_hant: 每行一個主機或萬用字元（例如：localhost、*.localhost、127.0.0.1、::1、0.0.0.0、*.localtest.me）。

# settings.browser.httpAllowlist.save
source: Save
ar: حفظ
bs: Spremi
da: Gem
de: Speichern
es: Guardar
fr: Enregistrer
it: Salva
ja: 保存
ko: 저장
nb: Lagre
pl: Zapisz
pt_br: Salvar
ru: Сохранить
th: บันทึก
tr: Kaydet
uk: Зберегти
zh_hans: 保存
zh_hant: 儲存

# settings.browser.httpAllowlist.reset
source: Reset to Defaults
ar: إعادة التعيين إلى الإعدادات الافتراضية
de: Auf Standardeinstellungen zurücksetzen
es: Restablecer los valores predeterminados
fr: Réinitialiser aux valeurs par défaut
ja: デフォルトに戻す
ko: 기본값으로 재설정
zh_hans: 恢复默认
zh_hant: 重設為預設值

# settings.browser.urlAllowlist
source: Embedded Browser URL Allowlist
ar: القائمة المسموحة لعناوين URL للمتصفح المدمج
de: Zulassungsliste für eingebettete Browser-URLs
es: Lista de permitidos de URL del navegador integrado
fr: Liste d’autorisation d’URL du navigateur intégré
ja: 内蔵ブラウザURL許可リスト
ko: 내장 브라우저 URL 허용 목록
zh_hans: 内嵌浏览器 URL 允许列表
zh_hant: 內嵌瀏覽器 URL 允許清單

# settings.browser.urlAllowlist.description
source: Restricts embedded-browser navigation to matching hosts or URL patterns. A suggested localhost list is shown; saving it opts into the restriction. Remove entries to block them, or, when no managed policy applies, clear the list to allow all web origins. Invalid-only values fail closed. Internal cmux documents remain available.
ar: يقيد التنقل في المتصفح المدمج على المضيفين المطابقين أو أنماط عناوين URL. يتم عرض قائمة localhost المقترحة؛ ويؤدي حفظها إلى تفعيل هذا التقييد. قم بإزالة المدخلات لحظرها، أو مسح القائمة للسماح بجميع مصادر الويب عند عدم تطبيق أي سياسة مدارة. تؤول القيم غير الصالحة فقط إلى الإغلاق (fail closed). تظل مستندات cmux الداخلية متاحة.
de: Schränkt die Navigation im eingebetteten Browser auf übereinstimmende Hosts oder URL-Muster ein. Eine vorgeschlagene localhost-Liste wird angezeigt; durch Speichern wird die Einschränkung aktiviert. Entfernen Sie Einträge, um sie zu blockieren, oder leeren Sie die Liste, um alle Web-Ursprünge zuzulassen, wenn keine verwaltete Richtlinie gilt. Nur ungültige Werte führen zu einer Sperrung (fail closed). Interne cmux-Dokumente bleiben verfügbar.
es: Restringe la navegación del navegador integrado a los hosts o patrones de URL coincidentes. Se muestra una lista sugerida de localhost; guardarla activa la restricción. Elimine entradas para bloquearlas o, cuando no se aplique ninguna política administrada, limpie la lista para permitir todos los orígenes web. Los valores que son únicamente no válidos no permiten el acceso en caso de fallo. Los documentos internos de cmux siguen estando disponibles.
fr: Restreint la navigation du navigateur intégré aux hôtes ou motifs d’URL correspondants. Une liste de localhost suggérée est affichée ; son enregistrement active la restriction. Supprimez des entrées pour les bloquer ou, si aucune politique gérée ne s’applique, effacez la liste pour autoriser toutes les origines web. Les valeurs uniquement non valides bloquent par défaut. Les documents cmux internes restent disponibles.
ja: 内蔵ブラウザの移動を、一致するホストまたはURLパターンに制限します。localhostの候補リストが表示され、保存すると制限が有効になります。エントリを削除するとそのURLをブロックし、管理ポリシーがない場合にリストを空にするとすべてのWebオリジンを許可します。無効なルールだけの値は安全側でブロックされます。cmux内部ドキュメントは引き続き利用できます。
ko: 내장 브라우저 탐색을 일치하는 호스트 또는 URL 패턴으로 제한합니다. 권장되는 localhost 목록이 표시되며, 이를 저장하면 제한 사항을 적용하도록 설정합니다. 이를 차단하려면 항목을 제거하고, 적용되는 관리 정책이 없는 경우 목록을 비워 모든 웹 원본을 허용하십시오. 잘못된 값만 있는 경우 안전하게 차단 모드로 자동 전환됩니다. cmux 내부 문서는 계속 사용할 수 있습니다.
zh_hans: 把内嵌浏览器的导航限制在匹配的主机或 URL 模式内。这里会显示一份建议的 localhost 列表；保存即表示启用该限制。移除条目即可拦截它们；在没有托管策略时，清空列表可放行所有 web 源。全部无效的取值会按拒绝处理。cmux 内部文档始终可用。
zh_hant: 限制內嵌瀏覽器僅能瀏覽符合的主機或 URL 模式。系統會顯示建議的 localhost 清單；儲存該清單即表示接受此限制。移除項目即可封鎖它們，或者在未套用受控原則時，清除清單以允許所有網頁來源。僅包含無效值的設定將預設安全關閉（不允許瀏覽）。內部 cmux 文件仍可使用。

# settings.browser.urlAllowlist.hint
source: One rule per line: localhost, *.localhost, example.com, https://git.example.com, or http://localhost:3000. Remove entries to block them.
ar: قاعدة واحدة لكل سطر: localhost، أو *.localhost، أو example.com، أو https://git.example.com، أو http://localhost:3000. قم بإزالة المدخلات لحظرها.
de: Eine Regel pro Zeile: localhost, *.localhost, example.com, https://git.example.com oder http://localhost:3000. Entfernen Sie Einträge, um sie zu blockieren.
es: Una regla por línea: localhost, *.localhost, example.com, https://git.example.com o http://localhost:3000. Elimine entradas para bloquearlas.
fr: Une règle par ligne : localhost, *.localhost, example.com, https://git.example.com ou http://localhost:3000. Supprimez des entrées pour les bloquer.
ja: 1行に1ルール: localhost、*.localhost、example.com、https://git.example.com、または http://localhost:3000。エントリを削除するとそのURLをブロックします。
ko: 한 줄에 한 규칙씩 입력하십시오: localhost, *.localhost, example.com, https://git.example.com 또는 http://localhost:3000. 차단하려면 항목을 제거하십시오.
zh_hans: 每行一条规则：localhost、*.localhost、example.com、https://git.example.com 或 http://localhost:3000。移除条目即可拦截它们。
zh_hant: 每行一條規則：localhost、*.localhost、example.com、https://git.example.com 或 http://localhost:3000。移除項目即可封鎖它們。

# settings.browser.urlAllowlist.invalidRule
source: One or more rules are invalid. Invalid-only values fail closed; use a host or HTTP(S) URL pattern.
ar: قاعدة واحدة أو أكثر غير صالحة. تؤول القيم غير الصالحة فقط إلى الإغلاق (fail closed)؛ استخدم نمط مضيف أو عنوان URL من نوع HTTP(S).
de: Eine oder mehrere Regeln sind ungültig. Nur ungültige Werte führen zu einer Sperrung (fail closed); verwenden Sie einen Host oder ein HTTP(S)-URL-Muster.
es: Una o más reglas no son válidas. Los valores que son únicamente no válidos no permiten el acceso en caso de fallo; use un host o un patrón de URL HTTP(S).
fr: Une ou plusieurs règles sont non valides. Les valeurs uniquement non valides bloquent par défaut ; utilisez un hôte ou un motif d’URL HTTP(S).
ja: 無効なルールがあります。無効なルールだけの値は安全側でブロックされます。ホストまたはHTTP(S) URLパターンを使用してください。
ko: 하나 이상의 규칙이 잘못되었습니다. 잘못된 값만 입력될 경우 차단 모드로 작동하므로, 호스트 또는 HTTP(S) URL 패턴을 사용하십시오.
zh_hans: 有一条或多条规则无效。全部无效的取值会按拒绝处理；请使用主机名或 HTTP(S) URL 模式。
zh_hant: 有一或多個規則無效。僅包含無效值的設定將預設安全關閉（不允許瀏覽）；請使用主機或 HTTP(S) URL 模式。

# settings.browser.urlAllowlist.save
source: Save
ar: حفظ
de: Speichern
es: Guardar
fr: Enregistrer
ja: 保存
ko: 저장
zh_hans: 保存
zh_hant: 儲存
